Consulta CEP.postman_collection.json

{
	"info": {
		"_postman_id": "671ae2b4-2c7d-4c69-a042-d542c2af6521",
		"name": "Consulta CEP",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json",
		"_exporter_id": "14377488"
	},
	"item": [
		{
			"name": "CEP",
			"request": {
				"method": "POST",
				"header": [],
				"body": {
					"mode": "raw",
					"raw": "<x:Envelope\r\n    xmlns:x=\"http://schemas.xmlsoap.org/soap/envelope/\"\r\n    xmlns:cli=\"http://cliente.bean.master.sigep.bsb.correios.com.br/\">\r\n    <x:Header/>\r\n    <x:Body>\r\n        <cli:consultaCEP>\r\n            <cep>92020303</cep>\r\n        </cli:consultaCEP>\r\n    </x:Body>\r\n</x:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "https://apps.correios.com.br/SigepMasterJPA/AtendeClienteService/AtendeCliente",
					"protocol": "https",
					"host": [
						"apps",
						"correios",
						"com",
						"br"
					],
					"path": [
						"SigepMasterJPA",
						"AtendeClienteService",
						"AtendeCliente"
					]
				}
			},
			"response": []
		}
	]
}